const binaryMap = {
    "0": ["0", "0", "0", "0"],
    "1": ["0", "0", "0", "1"],
    "2": ["0", "0", "1", "0"],
    "3": ["0", "0", "1", "1"],
    "4": ["0", "1", "0", "0"],
    "5": ["0", "1", "0", "1"],
    "6": ["0", "1", "1", "0"],
    "7": ["0", "1", "1", "1"],
    "8": ["1", "0", "0", "0"],
    "9": ["1", "0", "0", "1"],
    "a": ["1", "0", "1", "0"],
    "b": ["1", "0", "1", "1"],
    "c": ["1", "1", "0", "0"],
    "d": ["1", "1", "0", "1"],
    "e": ["1", "1", "1", "0"],
    "f": ["1", "1", "1", "1"],
    };
export function hexToBinaryArray(hexString) {
    const binaryArray = hexString
        .split("") // 将字符串拆分为单个字符数组
        .map((hex) => binaryMap[hex.toLowerCase()]) // 将每个 16 进制数字转换为长度为 4 的二进制字符串数组
        .flat(); // 将所有二进制字符串数组拼接为一个数组

    return binaryArray;
}